# SQL playground

Notebook to play with advanced SQL queries. Topics include:
- String manipulation
- Case statements
- Variables
- Aggregate functions
- Pivot tables
- Subqueries (correlated and non-correlated)
- Windows
- Views
- Profiling
- Functions and stored procedures

## Load database

In [1]:
%load_ext sql
%sql mysql://chinook:password@localhost/chinook

![](data/chinook_diagram.png)

## String manipulation

What is the department, username, and area_code for each employee?

In [33]:
%%sql

SELECT 
    CONCAT(first_name, ' ', last_name) AS name,
    SUBSTRING_index(email, '@', 1) AS username,
    CASE 
        WHEN LOCATE('Manager', title) THEN 'manager'
        ELSE LOWER(SUBSTRING_index(title, ' ', 1))
    END AS department,
    SUBSTR(phone, LOCATE('(', phone)+1, 3) AS area_code
FROM employee;

 * mysql://chinook:***@localhost/chinook
8 rows affected.

[('Andrew Adams', 'andrew', 'manager', '780'),
 ('Nancy Edwards', 'nancy', 'manager', '403'),
 ('Jane Peacock', 'jane', 'sales', '403'),
 ('Margaret Park', 'margaret', 'sales', '403'),
 ('Steve Johnson', 'steve', 'sales', '780'),
 ('Michael Mitchell', 'michael', 'manager', '403'),
 ('Robert King', 'robert', 'it', '403'),
 ('Laura Callahan', 'laura', 'it', '403')]

## Aggregate functions

Which countries have the largest number of sales and what is the average number of tracks sold and price of each sale?

In [49]:
%%sql

SELECT 
    billing_country AS country, 
    COUNT(total) AS sales,
    ROUND(AVG(il.number_of_tracks), 2) AS tracks_per_sale
FROM invoice i
LEFT JOIN (
    SELECT 
        invoice_id, 
        SUM(quantity) AS number_of_tracks
    FROM invoice_line
    GROUP BY invoice_id
) il ON i.invoice_id = il.invoice_id
GROUP BY billing_country
ORDER BY sales DESC, tracks_per_sale DESC
LIMIT 10;

 * mysql://chinook:***@localhost/chinook
10 rows affected.

[('USA', 131, Decimal('8.02')),
 ('Canada', 76, Decimal('7.12')),
 ('Brazil', 61, Decimal('7.08')),
 ('France', 50, Decimal('7.86')),
 ('Germany', 41, Decimal('8.24')),
 ('Czech Republic', 30, Decimal('9.20')),
 ('Portugal', 29, Decimal('6.45')),
 ('United Kingdom', 28, Decimal('8.86')),
 ('India', 21, Decimal('8.81')),
 ('Ireland', 13, Decimal('8.92'))]

## Todo

- Variables
- Pivot tables (https://mode.com/sql-tutorial/sql-pivot-table/)
- Subqueries (correlated and non-correlated)
- Windows (https://mode.com/sql-tutorial/sql-window-functions/)
- Views
- Profiling (https://mode.com/sql-tutorial/sql-performance-tuning/?)
- Functions and stored procedures
- Other? (https://stackoverflow.com/questions/2054130/what-is-advanced-sql)

## Functions

%%sql

SELECT billing_address
FROM invoice